GopalSaraf/Practicals/PSDL/include/proc/pic18f86j90.inc
#define S01C1                            BANKMASK(LCDDATA6), 1, a
#define S01C2                            BANKMASK(LCDDATA12), 1, a
#define S01C3                            BANKMASK(LCDDATA18), 1, a
#define S02C0                            BANKMASK(LCDDATA0), 2, a
#define S02C1                            BANKMASK(LCDDATA6), 2, a
#define S02C2                            BANKMASK(LCDDATA12), 2, a
#define S02C3                            BANKMASK(LCDDATA18), 2, a
#define S03C0                            BANKMASK(LCDDATA0), 3, a
#define S03C1                            BANKMASK(LCDDATA6), 3, a
#define S03C2                            BANKMASK(LCDDATA12), 3, a
#define S03C3                            BANKMASK(LCDDATA18), 3, a
#define S04C0                            BANKMASK(LCDDATA0), 4, a
#define S04C1                            BANKMASK(LCDDATA6), 4, a
#define S04C2                            BANKMASK(LCDDATA12), 4, a
#define S04C3                            BANKMASK(LCDDATA18), 4, a
#define S05C0                            BANKMASK(LCDDATA0), 5, a
#define S05C1                            BANKMASK(LCDDATA6), 5, a
#define S05C2                            BANKMASK(LCDDATA12), 5, a
#define S05C3                            BANKMASK(LCDDATA18), 5, a
#define S06C0                            BANKMASK(LCDDATA0), 6, a
#define S06C1                            BANKMASK(LCDDATA6), 6, a
#define S06C2                            BANKMASK(LCDDATA12), 6, a
#define S06C3                            BANKMASK(LCDDATA18), 6, a
#define S07C0                            BANKMASK(LCDDATA0), 7, a
#define S07C1                            BANKMASK(LCDDATA6), 7, a
#define S07C2                            BANKMASK(LCDDATA12), 7, a
#define S07C3                            BANKMASK(LCDDATA18), 7, a
#define S08C0                            BANKMASK(LCDDATA1), 0, a
#define S08C1                            BANKMASK(LCDDATA7), 0, a
#define S08C2                            BANKMASK(LCDDATA13), 0, a
#define S08C3                            BANKMASK(LCDDATA19), 0, a
#define S09C0                            BANKMASK(LCDDATA1), 1, a
#define S09C1                            BANKMASK(LCDDATA7), 1, a
#define S09C2                            BANKMASK(LCDDATA13), 1, a
#define S09C3                            BANKMASK(LCDDATA19), 1, a
#define S0C0                             BANKMASK(LCDDATA0), 0, a
#define S0C1                             BANKMASK(LCDDATA6), 0, a
#define S0C2                             BANKMASK(LCDDATA12), 0, a
#define S0C3                             BANKMASK(LCDDATA18), 0, a
#define S10C0                            BANKMASK(LCDDATA1), 2, a
#define S10C1                            BANKMASK(LCDDATA7), 2, a
#define S10C2                            BANKMASK(LCDDATA13), 2, a
#define S10C3                            BANKMASK(LCDDATA19), 2, a
#define S11C0                            BANKMASK(LCDDATA1), 3, a
#define S11C1                            BANKMASK(LCDDATA7), 3, a
#define S11C2                            BANKMASK(LCDDATA13), 3, a
#define S11C3                            BANKMASK(LCDDATA19), 3, a
#define S12C0                            BANKMASK(LCDDATA1), 4, a
#define S12C1                            BANKMASK(LCDDATA7), 4, a
#define S12C2                            BANKMASK(LCDDATA13), 4, a
#define S12C3                            BANKMASK(LCDDATA19), 4, a
#define S13C0                            BANKMASK(LCDDATA1), 5, a
#define S13C1                            BANKMASK(LCDDATA7), 5, a
#define S13C2                            BANKMASK(LCDDATA13), 5, a
#define S13C3                            BANKMASK(LCDDATA19), 5, a
#define S14C0                            BANKMASK(LCDDATA1), 6, a
#define S14C1                            BANKMASK(LCDDATA7), 6, a
#define S14C2                            BANKMASK(LCDDATA13), 6, a
#define S14C3                            BANKMASK(LCDDATA19), 6, a
#define S15C0                            BANKMASK(LCDDATA1), 7, a
#define S15C1                            BANKMASK(LCDDATA7), 7, a
#define S15C2                            BANKMASK(LCDDATA13), 7, a
#define S15C3                            BANKMASK(LCDDATA19), 7, a
#define S16C0                            BANKMASK(LCDDATA2), 0, a
#define S16C1                            BANKMASK(LCDDATA8), 0, a
#define S16C2                            BANKMASK(LCDDATA14), 0, a
#define S16C3                            BANKMASK(LCDDATA20), 0, a
#define S17C0                            BANKMASK(LCDDATA2), 1, a
#define S17C1                            BANKMASK(LCDDATA8), 1, a
#define S17C2                            BANKMASK(LCDDATA14), 1, a
#define S17C3                            BANKMASK(LCDDATA20), 1, a
#define S18C0                            BANKMASK(LCDDATA2), 2, a
#define S18C1                            BANKMASK(LCDDATA8), 2, a
#define S18C2                            BANKMASK(LCDDATA14), 2, a
#define S18C3                            BANKMASK(LCDDATA20), 2, a
#define S19C0                            BANKMASK(LCDDATA2), 3, a
#define S19C1                            BANKMASK(LCDDATA8), 3, a
#define S19C2                            BANKMASK(LCDDATA14), 3, a
#define S19C3                            BANKMASK(LCDDATA20), 3, a
#define S1C0                             BANKMASK(LCDDATA0), 1, a
#define S1C1                             BANKMASK(LCDDATA6), 1, a
#define S1C2                             BANKMASK(LCDDATA12), 1, a
#define S1C3                             BANKMASK(LCDDATA18), 1, a
#define S20C0                            BANKMASK(LCDDATA2), 4, a
#define S20C1                            BANKMASK(LCDDATA8), 4, a
#define S20C2                            BANKMASK(LCDDATA14), 4, a
#define S20C3                            BANKMASK(LCDDATA20), 4, a
#define S21C0                            BANKMASK(LCDDATA2), 5, a
#define S21C1                            BANKMASK(LCDDATA8), 5, a
#define S21C2                            BANKMASK(LCDDATA14), 5, a
#define S21C3                            BANKMASK(LCDDATA20), 5, a
#define S22C0                            BANKMASK(LCDDATA2), 6, a
#define S22C1                            BANKMASK(LCDDATA8), 6, a
#define S22C2                            BANKMASK(LCDDATA14), 6, a
#define S22C3                            BANKMASK(LCDDATA20), 6, a
#define S23C0                            BANKMASK(LCDDATA2), 7, a
#define S23C1                            BANKMASK(LCDDATA8), 7, a
#define S23C2                            BANKMASK(LCDDATA14), 7, a
#define S23C3                            BANKMASK(LCDDATA20), 7, a
#define S24C0                            BANKMASK(LCDDATA3), 0, a
#define S24C1                            BANKMASK(LCDDATA9), 0, a
#define S24C2                            BANKMASK(LCDDATA15), 0, a
#define S24C3                            BANKMASK(LCDDATA21), 0, a
#define S25C0                            BANKMASK(LCDDATA3), 1, a
#define S25C1                            BANKMASK(LCDDATA9), 1, a
#define S25C2                            BANKMASK(LCDDATA15), 1, a
#define S25C3                            BANKMASK(LCDDATA21), 1, a
#define S26C0                            BANKMASK(LCDDATA3), 2, a
#define S26C1                            BANKMASK(LCDDATA9), 2, a
#define S26C2                            BANKMASK(LCDDATA15), 2, a
#define S26C3                            BANKMASK(LCDDATA21), 2, a
#define S27C0                            BANKMASK(LCDDATA3), 3, a
#define S27C1                            BANKMASK(LCDDATA9), 3, a
#define S27C2                            BANKMASK(LCDDATA15), 3, a
#define S27C3                            BANKMASK(LCDDATA21), 3, a
#define S28C0                            BANKMASK(LCDDATA3), 4, a
#define S28C1                            BANKMASK(LCDDATA9), 4, a
#define S28C2                            BANKMASK(LCDDATA15), 4, a
#define S28C3                            BANKMASK(LCDDATA21), 4, a
#define S29C0                            BANKMASK(LCDDATA3), 5, a
#define S29C1                            BANKMASK(LCDDATA9), 5, a
#define S29C2                            BANKMASK(LCDDATA15), 5, a
#define S29C3                            BANKMASK(LCDDATA21), 5, a
#define S2C0                             BANKMASK(LCDDATA0), 2, a
#define S2C1                             BANKMASK(LCDDATA6), 2, a
#define S2C2                             BANKMASK(LCDDATA12), 2, a
#define S2C3                             BANKMASK(LCDDATA18), 2, a
#define S30C0                            BANKMASK(LCDDATA3), 6, a
#define S30C1                            BANKMASK(LCDDATA9), 6, a
#define S30C2                            BANKMASK(LCDDATA15), 6, a
#define S30C3                            BANKMASK(LCDDATA21), 6, a
#define S31C0                            BANKMASK(LCDDATA3), 7, a
#define S31C1                            BANKMASK(LCDDATA9), 7, a
#define S31C2                            BANKMASK(LCDDATA15), 7, a
#define S31C3                            BANKMASK(LCDDATA21), 7, a
#define S32C0                            BANKMASK(LCDDATA4), 0, a
#define S32C1                            BANKMASK(LCDDATA10), 0, a
#define S32C2                            BANKMASK(LCDDATA16), 0, a
#define S32C3                            BANKMASK(LCDDATA22), 0, a
#define S33C0                            BANKMASK(LCDDATA4), 1, a
#define S33C1                            BANKMASK(LCDDATA10), 1, a
#define S33C2                            BANKMASK(LCDDATA16), 1, a
#define S33C3                            BANKMASK(LCDDATA22), 1, a
#define S34C0                            BANKMASK(LCDDATA4), 2, a
#define S34C1                            BANKMASK(LCDDATA10), 2, a
#define S34C2                            BANKMASK(LCDDATA16), 2, a
#define S34C3                            BANKMASK(LCDDATA22), 2, a
#define S35C0                            BANKMASK(LCDDATA4), 3, a
#define S35C1                            BANKMASK(LCDDATA10), 3, a
#define S35C2                            BANKMASK(LCDDATA16), 3, a
#define S35C3                            BANKMASK(LCDDATA22), 3, a
#define S36C0                            BANKMASK(LCDDATA4), 4, a
#define S36C1                            BANKMASK(LCDDATA10), 4, a
#define S36C2                            BANKMASK(LCDDATA16), 4, a
#define S36C3                            BANKMASK(LCDDATA22), 4, a
#define S37C0                            BANKMASK(LCDDATA4), 5, a
#define S37C1                            BANKMASK(LCDDATA10), 5, a
#define S37C2                            BANKMASK(LCDDATA16), 5, a
#define S37C3                            BANKMASK(LCDDATA22), 5, a
#define S38C0                            BANKMASK(LCDDATA4), 6, a
#define S38C1                            BANKMASK(LCDDATA10), 6, a
#define S38C2                            BANKMASK(LCDDATA16), 6, a
#define S38C3                            BANKMASK(LCDDATA22), 6, a
#define S39C0                            BANKMASK(LCDDATA4), 7, a
#define S39C1                            BANKMASK(LCDDATA10), 7, a
#define S39C2                            BANKMASK(LCDDATA16), 7, a
#define S39C3                            BANKMASK(LCDDATA22), 7, a
#define S3C0                             BANKMASK(LCDDATA0), 3, a
#define S3C1                             BANKMASK(LCDDATA6), 3, a
#define S3C2                             BANKMASK(LCDDATA12), 3, a
#define S3C3                             BANKMASK(LCDDATA18), 3, a
#define S40C0                            BANKMASK(LCDDATA5), 0, a
#define S40C1                            BANKMASK(LCDDATA11), 0, a
#define S40C15                           BANKMASK(LCDDATA5), 0, a
#define S40C2                            BANKMASK(LCDDATA17), 0, a
#define S40C3                            BANKMASK(LCDDATA23), 0, a
#define S41C0                            BANKMASK(LCDDATA5), 1, a
#define S41C1                            BANKMASK(LCDDATA11), 1, a
#define S41C2                            BANKMASK(LCDDATA17), 1, a
#define S41C3                            BANKMASK(LCDDATA23), 1, a
#define S42C0                            BANKMASK(LCDDATA5), 2, a
#define S42C1                            BANKMASK(LCDDATA11), 2, a
#define S42C2                            BANKMASK(LCDDATA17), 2, a
#define S42C3                            BANKMASK(LCDDATA23), 2, a
#define S43C0                            BANKMASK(LCDDATA5), 3, a
#define S43C1                            BANKMASK(LCDDATA11), 3, a
#define S43C2                            BANKMASK(LCDDATA17), 3, a
#define S43C3                            BANKMASK(LCDDATA23), 3, a
#define S44C0                            BANKMASK(LCDDATA5), 4, a
#define S44C1                            BANKMASK(LCDDATA11), 4, a
#define S44C2                            BANKMASK(LCDDATA17), 4, a
#define S44C3                            BANKMASK(LCDDATA23), 4, a
#define S45C0                            BANKMASK(LCDDATA5), 5, a
#define S45C1                            BANKMASK(LCDDATA11), 5, a
#define S45C2                            BANKMASK(LCDDATA17), 5, a
#define S45C3                            BANKMASK(LCDDATA23), 5, a
#define S46C0                            BANKMASK(LCDDATA5), 6, a
#define S46C1                            BANKMASK(LCDDATA11), 6, a
#define S46C2                            BANKMASK(LCDDATA17), 6, a
#define S46C3                            BANKMASK(LCDDATA23), 6, a
#define S47C0                            BANKMASK(LCDDATA5), 7, a
#define S47C1                            BANKMASK(LCDDATA11), 7, a
#define S47C2                            BANKMASK(LCDDATA17), 7, a
#define S47C3                            BANKMASK(LCDDATA23), 7, a
#define S4C0                             BANKMASK(LCDDATA0), 4, a
#define S4C1                             BANKMASK(LCDDATA6), 4, a
#define S4C2                             BANKMASK(LCDDATA12), 4, a
#define S4C3                             BANKMASK(LCDDATA18), 4, a
#define S5C0                             BANKMASK(LCDDATA0), 5, a
#define S5C1                             BANKMASK(LCDDATA6), 5, a
#define S5C2                             BANKMASK(LCDDATA12), 5, a
#define S5C3                             BANKMASK(LCDDATA18), 5, a
#define S6C0                             BANKMASK(LCDDATA0), 6, a
#define S6C1                             BANKMASK(LCDDATA6), 6, a
#define S6C2                             BANKMASK(LCDDATA12), 6, a
#define S6C3                             BANKMASK(LCDDATA18), 6, a
#define S7C0                             BANKMASK(LCDDATA0), 7, a
#define S7C1                             BANKMASK(LCDDATA6), 7, a
#define S7C2                             BANKMASK(LCDDATA12), 7, a
#define S7C3                             BANKMASK(LCDDATA18), 7, a
#define S8C0                             BANKMASK(LCDDATA1), 0, a
#define S8C1                             BANKMASK(LCDDATA7), 0, a
#define S8C2                             BANKMASK(LCDDATA13), 0, a
#define S8C3                             BANKMASK(LCDDATA19), 0, a
#define S9C0                             BANKMASK(LCDDATA1), 1, a
#define S9C1                             BANKMASK(LCDDATA7), 1, a
#define S9C2                             BANKMASK(LCDDATA13), 1, a
#define S9C3                             BANKMASK(LCDDATA19), 1, a
#define SCK                              BANKMASK(PORTC), 3, a
#define SCKP                             BANKMASK(BAUDCON1), 4, a
#define SCKP1                            BANKMASK(BAUDCON1), 4, a
#define SCL                              BANKMASK(PORTC), 3, a
#define SCS0                             BANKMASK(OSCCON), 0, a
#define SCS1                             BANKMASK(OSCCON), 1, a
#define SDA                              BANKMASK(PORTC), 4, a
#define SDI                              BANKMASK(PORTC), 4, a
#define SDO                              BANKMASK(PORTC), 5, a
#define SE0                              BANKMASK(LCDSE0), 0, a
#define SE00                             BANKMASK(LCDSE0), 0, a
#define SE01                             BANKMASK(LCDSE0), 1, a
#define SE02                             BANKMASK(LCDSE0), 2, a
#define SE03                             BANKMASK(LCDSE0), 3, a
#define SE04                             BANKMASK(LCDSE0), 4, a
#define SE05                             BANKMASK(LCDSE0), 5, a
#define SE06                             BANKMASK(LCDSE0), 6, a
#define SE07                             BANKMASK(LCDSE0), 7, a
#define SE08                             BANKMASK(LCDSE1), 0, a
#define SE09                             BANKMASK(LCDSE1), 1, a
#define SE1                              BANKMASK(LCDSE0), 1, a
#define SE10                             BANKMASK(LCDSE1), 2, a
#define SE11                             BANKMASK(LCDSE1), 3, a
#define SE12                             BANKMASK(LCDSE1), 4, a
#define SE13                             BANKMASK(LCDSE1), 5, a
#define SE14                             BANKMASK(LCDSE1), 6, a
#define SE15                             BANKMASK(LCDSE1), 7, a
#define SE16                             BANKMASK(LCDSE2), 0, a
#define SE17                             BANKMASK(LCDSE2), 1, a
#define SE18                             BANKMASK(LCDSE2), 2, a
#define SE19                             BANKMASK(LCDSE2), 3, a
#define SE2                              BANKMASK(LCDSE0), 2, a
#define SE20                             BANKMASK(LCDSE2), 4, a
#define SE21                             BANKMASK(LCDSE2), 5, a
#define SE22                             BANKMASK(LCDSE2), 6, a
#define SE23                             BANKMASK(LCDSE2), 7, a
#define SE24                             BANKMASK(LCDSE3), 0, a
#define SE25                             BANKMASK(LCDSE3), 1, a
#define SE26                             BANKMASK(LCDSE3), 2, a
#define SE27                             BANKMASK(LCDSE3), 3, a
#define SE28                             BANKMASK(LCDSE3), 4, a
#define SE29                             BANKMASK(LCDSE3), 5, a
#define SE3                              BANKMASK(LCDSE0), 3, a
#define SE30                             BANKMASK(LCDSE3), 6, a
#define SE31                             BANKMASK(LCDSE3), 7, a
#define SE32                             BANKMASK(LCDSE4), 0, a
#define SE33                             BANKMASK(LCDSE4), 1, a
#define SE34                             BANKMASK(LCDSE4), 2, a
#define SE35                             BANKMASK(LCDSE4), 3, a
#define SE36                             BANKMASK(LCDSE4), 4, a
#define SE37                             BANKMASK(LCDSE4), 5, a
#define SE38                             BANKMASK(LCDSE4), 6, a
#define SE39                             BANKMASK(LCDSE4), 7, a
#define SE4                              BANKMASK(LCDSE0), 4, a
#define SE40                             BANKMASK(LCDSE5), 0, a
#define SE41                             BANKMASK(LCDSE5), 1, a
#define SE42                             BANKMASK(LCDSE5), 2, a
#define SE43                             BANKMASK(LCDSE5), 3, a
#define SE44                             BANKMASK(LCDSE5), 4, a
#define SE45                             BANKMASK(LCDSE5), 5, a
#define SE46                             BANKMASK(LCDSE5), 6, a
#define SE47                             BANKMASK(LCDSE5), 7, a
#define SE5                              BANKMASK(LCDSE0), 5, a
#define SE6                              BANKMASK(LCDSE0), 6, a
#define SE7                              BANKMASK(LCDSE0), 7, a
#define SE8                              BANKMASK(LCDSE1), 0, a
#define SE9                              BANKMASK(LCDSE1), 1, a
#define SEG0                             BANKMASK(PORTD), 0, a
#define SEG00COM3                        BANKMASK(LCDDATA18), 0, a
#define SEG01COM3                        BANKMASK(LCDDATA18), 1, a
#define SEG02COM3                        BANKMASK(LCDDATA18), 2, a
#define SEG03COM3                        BANKMASK(LCDDATA18), 3, a
#define SEG04COM3                        BANKMASK(LCDDATA18), 4, a
#define SEG05COM3                        BANKMASK(LCDDATA18), 5, a
#define SEG06COM3                        BANKMASK(LCDDATA18), 6, a
#define SEG07COM3                        BANKMASK(LCDDATA18), 7, a
#define SEG0COM0                         BANKMASK(LCDDATA0), 0, a
#define SEG0COM1                         BANKMASK(LCDDATA6), 0, a
#define SEG0COM2                         BANKMASK(LCDDATA12), 0, a
#define SEG1                             BANKMASK(PORTD), 1, a
#define SEG10                            BANKMASK(PORTB), 3, a
#define SEG10COM0                        BANKMASK(LCDDATA1), 2, a
#define SEG10COM1                        BANKMASK(LCDDATA7), 2, a
#define SEG10COM2                        BANKMASK(LCDDATA13), 2, a
#define SEG10COM3                        BANKMASK(LCDDATA19), 2, a
#define SEG11                            BANKMASK(PORTB), 4, a
#define SEG11COM0                        BANKMASK(LCDDATA1), 3, a
#define SEG11COM1                        BANKMASK(LCDDATA7), 3, a
#define SEG11COM2                        BANKMASK(LCDDATA13), 3, a
#define SEG11COM3                        BANKMASK(LCDDATA19), 3, a
#define SEG12                            BANKMASK(PORTC), 5, a
#define SEG12COM0                        BANKMASK(LCDDATA1), 4, a
#define SEG12COM1                        BANKMASK(LCDDATA7), 4, a
#define SEG12COM2                        BANKMASK(LCDDATA13), 4, a
#define SEG12COM3                        BANKMASK(LCDDATA19), 4, a
#define SEG13                            BANKMASK(PORTC), 2, a
#define SEG13COM0                        BANKMASK(LCDDATA1), 5, a
#define SEG13COM1                        BANKMASK(LCDDATA7), 5, a
#define SEG13COM2                        BANKMASK(LCDDATA13), 5, a
#define SEG13COM3                        BANKMASK(LCDDATA19), 5, a
#define SEG14                            BANKMASK(PORTA), 4, a
#define SEG14COM0                        BANKMASK(LCDDATA1), 6, a
#define SEG14COM1                        BANKMASK(LCDDATA7), 6, a
#define SEG14COM2                        BANKMASK(LCDDATA13), 6, a
#define SEG14COM3                        BANKMASK(LCDDATA19), 6, a
#define SEG15                            BANKMASK(PORTA), 5, a
#define SEG15COM0                        BANKMASK(LCDDATA1), 7, a
#define SEG15COM1                        BANKMASK(LCDDATA7), 7, a
#define SEG15COM2                        BANKMASK(LCDDATA13), 7, a
#define SEG15COM3                        BANKMASK(LCDDATA19), 7, a
#define SEG16                            BANKMASK(PORTC), 4, a
#define SEG16COM0                        BANKMASK(LCDDATA2), 0, a
#define SEG16COM1                        BANKMASK(LCDDATA8), 0, a
#define SEG16COM2                        BANKMASK(LCDDATA14), 0, a
#define SEG16COM3                        BANKMASK(LCDDATA20), 0, a
#define SEG17                            BANKMASK(PORTC), 3, a
#define SEG17COM0                        BANKMASK(LCDDATA2), 1, a
#define SEG17COM1                        BANKMASK(LCDDATA8), 1, a
#define SEG17COM2                        BANKMASK(LCDDATA14), 1, a
#define SEG17COM3                        BANKMASK(LCDDATA20), 1, a
#define SEG18                            BANKMASK(PORTA), 1, a
#define SEG18COM0                        BANKMASK(LCDDATA2), 2, a
#define SEG18COM1                        BANKMASK(LCDDATA8), 2, a
#define SEG18COM2                        BANKMASK(LCDDATA14), 2, a
#define SEG18COM3                        BANKMASK(LCDDATA20), 2, a
#define SEG19                            BANKMASK(PORTF), 1, a
#define SEG19COM0                        BANKMASK(LCDDATA2), 3, a
#define SEG19COM1                        BANKMASK(LCDDATA8), 3, a
#define SEG19COM2                        BANKMASK(LCDDATA14), 3, a
#define SEG19COM3                        BANKMASK(LCDDATA20), 3, a
#define SEG1COM0                         BANKMASK(LCDDATA0), 1, a
#define SEG1COM1                         BANKMASK(LCDDATA6), 1, a
#define SEG1COM2                         BANKMASK(LCDDATA12), 1, a
#define SEG2                             BANKMASK(PORTD), 2, a
#define SEG20                            BANKMASK(PORTF), 2, a
